Config/Documents/НачислениеОтПосредникаГИСГМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеОтПосредникаГИСГМП</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация - посредник, сформировавший платеж</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПППолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКвитанции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБКПлатежа</Name>
					<Comment>Код бюджетной классификации доходов РФ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОКТМО</Name>
					<Comment>Код ОКТМО сборщика платежей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>235</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентПлательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлательщикНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательДаты</Name>
					<Comment>Дата документа - основания перечисления  налога, сбора или иного платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательНомера</Name>
					<Comment>Номер документа - основания перечисления  налога, сбора или иного платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательОснования</Name>
					<Comment>Условное обозначение основания налогового платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПериода</Name>
					<Comment>Условное обозначение периода, за который перечисляется налог</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТипа</Name>
					<Comment>Условное обозначение типа налогового платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаможенныйПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательБанковскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательБИКБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательКорСчетБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательНаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательОГРН</Name>
					<Comment>Основной государственный регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСоставителя</Name>
					<Comment>Статус составителя платежного документа на перечисление налогов, сборов и иных обязательных платежей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторНачисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаАннулирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияСкидки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПонижающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойИдентификаторПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйИдентификаторПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированнаяСуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсталосьОплатить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержимоеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКвитирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРеквизитовДляНачисленияПосредника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатИмпортаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатИмпортаОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОтправкиСообщенийВСМЭВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВФайле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/РезультатыОтправкиСообщенийВСМЭВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РезультатыОтправкиСообщенийВСМЭВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятСМЭВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанБезОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанЕстьОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПрошелАсинхроннуюПроверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереведенВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученПолучателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПолучателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКаталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокХраненияСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/НачислениеОтПосредникаГИСГМП/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, ТекущийОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			
			Объект.УникальныйИдентификаторНачисления = "";
			Объект.РезультатИмпортаКод = "";
			Объект.РезультатИмпортаОписание = "";
			Объект.ПричинаАннулирования = "";
			Объект.ДатаИзменения = Неопределено;
			Объект.СуммаДокумента = 0;
			Объект.СодержимоеФайла = "";
			
		КонецЕсли;
		
		Объект.ВидКвитанции = 1;//новое
		Объект.СтатусОбработки = Перечисления.РезультатыОтправкиСообщенийВСМЭВ.НеОтправлен;
		
		Если ЗначениеЗаполнено(Объект.ШаблонНачисления) Тогда
			ЗаполнитьПоШаблонуНаСервере();
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.УникальныйИдентификаторНачисления)
			И ЗначениеЗаполнено(Объект.СуммаДокумента) Тогда 
			
			//в документе заполнена сумма участником АДБ, изменение документа посредником уже запрещено
			ЭтотОбъект.ТолькоПросмотр = Истина; 
			
		КонецЕсли;
	КонецЕсли;
			
	Если ЗначениеЗаполнено(Объект.РезультатИмпортаКод)
		ИЛИ ЗначениеЗаполнено(Объект.РезультатИмпортаОписание) Тогда
		ОписаниеРезультата = "Код = " + Объект.РезультатИмпортаКод + ", " + Объект.РезультатИмпортаОписание;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокДанныхКвитирования,"УИН",Объект.УникальныйИдентификаторНачисления,Истина);
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
		
	Если ЗначениеЗаполнено(Объект.ПроцентСкидки) Тогда
		ВидСкидки = 1;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПонижающийКоэффициент) Тогда
		ВидСкидки = 2;
	ИначеЕсли ЗначениеЗаполнено(Объект.ФиксированнаяСуммаСкидки) Тогда
		ВидСкидки = 3;
	КонецЕсли;
	
	Элементы.ГруппаСкидка.Видимость = (ВидСкидки <> 0);
	
	Если ВидСкидки = 1 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаПроцент;
	ИначеЕсли ВидСкидки = 2 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаКоэффициент;
	ИначеЕсли ВидСкидки = 3 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаФиксированная;
	КонецЕсли;
	
	Элементы.ПричинаАннулирования.ТолькоПросмотр = Объект.ВидКвитанции <= 1;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, БухгалтерскийУчетКлиентСервер.ПолучитьЗначенияНалоговыхРеквизитов(Объект));
	ТаможенныйПлатеж = Объект.ТаможенныйПлатеж;	
	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);
	
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтаФорма);
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	ПлатежноРасчетныеДокументы.ПередЗаписьюНаСервереДокумента(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСтатус_ПлатежноРасчетныйДокумент"
		И Объект.Ссылка = Источник Тогда
		//статус изменен вне документа, но форма документа открыта - обновим в форме
		ОбновитьСтатусПлатежноРасчетныногоДокумента();
		
	КонецЕсли;
	
	ПлатежноРасчетныеДокументыКлиент.ОбработатьОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонНачисленияПриИзменении(Элемент)
	ЗаполнитьПоШаблонуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)
	
	Объект.ФиксированнаяСуммаСкидки = 0;
	Объект.ПроцентСкидки = 0;
	Объект.ПонижающийКоэффициент = 0;
	Объект.ДатаОкончанияДействияСкидки = Неопределено;
	Элементы.ГруппаСкидка.Видимость = (ВидСкидки <> 0);
	
	Если ВидСкидки = 1 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаПроцент;
	ИначеЕсли ВидСкидки = 2 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаКоэффициент;
	ИначеЕсли ВидСкидки = 3 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаФиксированная;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКвитанцииПриИзменении(Элемент)
	
	Элементы.ПричинаАннулирования.ТолькоПросмотр = Объект.ВидКвитанции <= 1;
	
	Если Объект.ВидКвитанции >1 Тогда
		Объект.ДатаИзменения = ТекущаяДата();
	Иначе
		Объект.ДатаИзменения = "";
	КонецЕсли;
			
	Если Объект.ВидКвитанции<=1 Тогда
		Объект.ПричинаАннулирования = "";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленныйСтатусДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭтогоДокументаНажатие(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПлательщикПриИзменении(Элемент)
	КонтрагентПлательщикПриИзмененииНаСервере();
КонецПроцедуры

/////////////////////////////////////////////////////////////////////
//  ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ - Налоговые реквизиты

&НаКлиенте
Процедура ПолеВводаСтатусСоставителяПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("СтатусСоставителя", ПолеВводаСтатусСоставителя);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательОснованияПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("ПоказательОснования", ПолеВводаПоказательОснования);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательПериодаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаГодПериодаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаНомерПериодаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаДатаПериодаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаКодТаможенногоОрганаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательНомераПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("ПоказательНомера", ПолеВводаПоказательНомера);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательДатыПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("ПоказательДаты", ПолеВводаПоказательДаты);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательТипаПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("ПоказательТипа", ПолеВводаПоказательТипа);
КонецПроцедуры

&НаКлиенте
Процедура ТаможенныйПлатежПриИзменении(Элемент)
	Объект.ТаможенныйПлатеж = ТаможенныйПлатеж;
	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);
КонецПроцедуры

//--------------

&НаКлиенте
Процедура СтатусСоставителяПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("СтатусСоставителя");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательОснованияПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательОснования");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПериодаПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательПериода");

КонецПроцедуры

&НаКлиенте
Процедура ПоказательНомераПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательНомера");

КонецПроцедуры

&НаКлиенте
Процедура ПоказательДатыПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательДаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательТипаПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательТипа");

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(ИмяРеквизита, ЗначениеРеквизита)
	
	ЗаполнитьЗначенияСвойств(Объект, БухгалтерскийУчетКлиентСервер.НалоговыеРеквизитыПлатежногоДокумента(Новый Структура(ИмяРеквизита, ЗначениеРеквизита)));
    СписокРеквизитов = "ПоказательОснования,ПоказательПериода,ПоказательТипа,ПоказательНомера,ПоказательДаты,СтатусСоставителя";	
	БухгалтерскийУчетКлиентСервер.ЗаполнитьНезаполненныеНалоговыеРеквизиты(Объект,СписокРеквизитов, ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовПериодаНаКлиенте()
	
	ЗначенияРеквизитов = Новый Структура("ПоказательПериода, ПолеВводаГодПериода, ПолеВводаНомерПериода, ПолеВводаДатаПериода, ПолеВводаКодТаможенногоОргана");
    ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Объект);
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, ЭтаФорма);
	БухгалтерскийУчетКлиентСервер.ОпределитьРеквизитыНалоговогоПериода(ПолеВводаПоказательПериода, ТаможенныйПлатеж, Объект.Дата, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов);
	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);
    СписокРеквизитов = "ПоказательОснования,ПоказательПериода,ПоказательТипа,ПоказательНомера,ПоказательДаты,СтатусСоставителя";	
	БухгалтерскийУчетКлиентСервер.ЗаполнитьНезаполненныеНалоговыеРеквизиты(Объект,СписокРеквизитов, ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоказателяНаклиенте(ИмяПоказателя) 
	
	РеквизитыПлатежа = Новый Структура(ИмяПоказателя, Объект[ИмяПоказателя]);
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, БухгалтерскийУчетКлиентСервер.ПолучитьЗначенияНалоговыхРеквизитов(РеквизитыПлатежа));

	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТекстФайла(Команда)
	ПараметрыФормы = Новый Структура("ТекстФайла",Объект.СодержимоеФайла);
	ПараметрыФормы.Вставить("Заголовок","Содержимое полученного файла, по которому сформирован данный документ");
	ОткрытьФорму("ОбщаяФорма.ФормаПросмотраXML",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьПоШаблону(Команда)
	
	Если ЗначениеЗаполнено(Объект.УникальныйИдентификаторНачисления)
		И ЗначениеЗаполнено(Объект.СуммаДокумента) Тогда
		ТекстСообщения = НСтр("ru='В документе уже заполнена сумма участником - АДБ, изменение документа посредником запрещено.'"); 
		Возврат;
	КонецЕсли;
	
	Ответ = Ждать ВопросАсинх(НСтр("ru='Заполнить документ по выбранному шаблону?'"),РежимДиалогаВопрос.ДаНет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоШаблонуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИдентификаторы(Команда)
	
	ЗаполнитьИдентификаторыПлательщика();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура КонтрагентПлательщикПриИзмененииНаСервере()
	
	Объект.ОсновнойИдентификаторПлательщика = "";
	Объект.ДополнительныйИдентификаторПлательщика = "";
	Объект.ПлательщикНаименование = "";
	
	Если НЕ ЗначениеЗаполнено(Объект.КонтрагентПлательщик) Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.ПлательщикНаименование = БюджетнаяОтчетностьПолучениеНСИ.ОфициальноеНаименование(Объект.КонтрагентПлательщик,Истина);
	
	ЗаполнитьИдентификаторыПлательщика();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторыПлательщика()
	
	Если НЕ ЗначениеЗаполнено(Объект.КонтрагентПлательщик) Тогда
		Возврат;
	КонецЕсли;
	
	МассивФК = Неопределено;
	Если ЗначениеЗаполнено(Объект.ШаблонНачисления) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныРеквизитовДляНачисленияПосредника.НастройкаФормированияИдентификатораКонтрагента КАК НастройкаФормированияИдентификатораКонтрагента,
		|	НастройкиФормированияИдентификаторовКонтрагентовТаблицаНастроек.НомерСтроки КАК НомерСтроки,
		|	НастройкиФормированияИдентификаторовКонтрагентовТаблицаНастроек.КодФК КАК КодФК
		|ИЗ
		|	Справочник.ШаблоныРеквизитовДляНачисленияПосредника КАК ШаблоныРеквизитовДляНачисленияПосредника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиФормированияИдентификаторовКонтрагентов.ТаблицаНастроек КАК НастройкиФормированияИдентификаторовКонтрагентовТаблицаНастроек
		|		ПО ШаблоныРеквизитовДляНачисленияПосредника.НастройкаФормированияИдентификатораКонтрагента = НастройкиФормированияИдентификаторовКонтрагентовТаблицаНастроек.Ссылка
		|ГДЕ
		|	ШаблоныРеквизитовДляНачисленияПосредника.Ссылка = &ШаблонНачисления
		|	И НастройкиФормированияИдентификаторовКонтрагентовТаблицаНастроек.Использовать
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("ШаблонНачисления", Объект.ШаблонНачисления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		МассивФК = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("КодФК");
		Если МассивФК.Количество() = 0 Тогда
			МассивФК = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	МассивИдентификаторов = БухгалтерскийУчет.НесколькоИдентификаторовКонтрагента(Объект.КонтрагентПлательщик,Истина,2,Неопределено,МассивФК);
	
	КоличествоИдентификаторов = МассивИдентификаторов.Количество();
	
	Если КоличествоИдентификаторов >= 1 Тогда
		Объект.ОсновнойИдентификаторПлательщика = МассивИдентификаторов[0];
	КонецЕсли;
	
	Если КоличествоИдентификаторов >= 2 Тогда
		Объект.ДополнительныйИдентификаторПлательщика = МассивИдентификаторов[1];
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныРеквизитовДляНачисленияПосредника.Контрагент КАК Контрагент,
		|	ШаблоныРеквизитовДляНачисленияПосредника.ПолучательНаименование КАК ПолучательНаименование,
		|	ШаблоныРеквизитовДляНачисленияПосредника.ИННПолучателя КАК ИННПолучателя,
		|	ШаблоныРеквизитовДляНачисленияПосредника.КПППолучателя КАК КПППолучателя,
		|	ШаблоныРеквизитовДляНачисленияПосредника.УРНУчастника КАК УРНУчастника,
		|	ШаблоныРеквизитовДляНачисленияПосредника.НомерКазначейскогоСчета КАК ПолучательБанковскийСчет,
		|	ШаблоныРеквизитовДляНачисленияПосредника.БИКБанка КАК ПолучательБИКБанка,
		|	ШаблоныРеквизитовДляНачисленияПосредника.КорСчетБанка КАК ПолучательКорСчетБанка,
		|	ШаблоныРеквизитовДляНачисленияПосредника.УРНПосредника КАК УРНПосредника,
		|	ШаблоныРеквизитовДляНачисленияПосредника.КБК КАК КодБКПлатежа,
		|	ШаблоныРеквизитовДляНачисленияПосредника.ОКТМО КАК КодОКТМО,
		|	ШаблоныРеквизитовДляНачисленияПосредника.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ШаблоныРеквизитовДляНачисленияПосредника.ПоказательОснования КАК ПоказательОснования,
		|	ШаблоныРеквизитовДляНачисленияПосредника.ПоказательПериода КАК ПоказательПериода,
		|	ШаблоныРеквизитовДляНачисленияПосредника.ТаможенныйПлатеж КАК ТаможенныйПлатеж,
		|	ШаблоныРеквизитовДляНачисленияПосредника.ПоказательНомера КАК ПоказательНомера,
		|	ШаблоныРеквизитовДляНачисленияПосредника.ПоказательДаты КАК ПоказательДаты
		|ИЗ
		|	Справочник.ШаблоныРеквизитовДляНачисленияПосредника КАК ШаблоныРеквизитовДляНачисленияПосредника
		|ГДЕ
		|	ШаблоныРеквизитовДляНачисленияПосредника.Ссылка = &ШаблонНачисления";
	
	Запрос.УстановитьПараметр("ШаблонНачисления", Объект.ШаблонНачисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Объект,ВыборкаДетальныеЗаписи);
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, БухгалтерскийУчетКлиентСервер.ПолучитьЗначенияНалоговыхРеквизитов(Объект));
	ТаможенныйПлатеж = Объект.ТаможенныйПлатеж;	
	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);
	
	ЗаполнитьИдентификаторыПлательщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусДокумента()
	
	ПлатежноРасчетныеДокументыКлиент.ОткрытьФормуИзмененияСтатусаДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусПлатежноРасчетныногоДокумента()
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтаФорма);	
КонецПроцедуры

#КонецОбласти
